// συνάρτηση υπολογισμού της μετατόπισης με δεδομένα τη μέση ταχύτητα και τον χρόνο

function Displacement(U,T,units) {
    // δήλωση της μεταβλητής στην οποία θα αποθηκεύεται η τιμή της μετατόπισης
           let D = U * T;    // υπολογίζεται η τιμή της μετατόπισης
   
       // αν πρέπει να εμφανίσουμε μονάδες μέτρησης στο αποτέλεσμα
       if (units == true)
           D = D + " m.";   // μορφοποιείται το αποτέλεσμα σε μορφή συμβολοσειράς με μονάδα μέτρησης
   
       return D;       // επιστρέφεται η τιμή της μετατόπισης
   }      


   // συνάρτηση υπολογισμού του χρόνου με δεδομένα τη μέση ταχύτητα και τη μετατόπιση

   function Time(D,U,units) {
   
       // δήλωση της μεταβλητής στην οποία θα αποθηκεύεται η τιμή του χρόνου
       let T = 0;
       
       // D / U;   // υπολογίζεται ο χρόνος

       // αν η παράμετρος U δέν έχει την τιμή 0, τότε
       if (U != 0)
       T = D / U;  // υπολογίζεται η τιμή του χρόνου
   
       // αν πρέπει να εμφανίσουμε μονάδες μέτρησης στο αποτέλεσμα 
       if (units == true)
           T = T + " s."; // μορφοποιείται το αποτέλεσμα σε μορφή συμβολοσειράς με μονάδα μέτρησης
   
       return T;    // επιστρέφεται η τιμή του χρόνου 
   }


   // συνάρτηση υπολογισμού της μέσης ταχύτητας με δεδομένα τη μετατόπιση και τον χρόνο 

   function Velocity(D,T,units) {
       // δήλωση της μεταβλητής στην οποία θα αποθηκεύεται η τιμή της μέσης ταχύτητας
       let U = 0;

       // αν η παράμετρος T δέν έχει την τιμή 0, τότε
       if (T != 0)
           U = D / T;  // υπολογίζεται η τιμή της μέσης ταχύτητας 
   
       // αν πρέπει να εμφανίσουμε μονάδες μέτρησης στο αποτέλεσμα 
       if (units == true)
              U = U + " m/s."; // μορφοποιείται το αποτέλεσμα σε μορφή συμβολοσειράς με μονάδα μέτρησης

       return U;  // επιστρέφεται η τιμή της μέσης ταχύτητας
   }